.config/dotfiles.org
#+title: Dotfiles
#+STARTUP: showeverything

#+begin_comment
        __      __  _____ __
   ____/ /___  / /_/ __(_) /__  _____
  / __  / __ \/ __/ /_/ / / _ \/ ___/
 / /_/ / /_/ / /_/ __/ / /  __(__  )
 \__,_/\____/\__/_/ /_/_/\___/____/

 Maintainer: Kyle Gortych
 github:     [[https://github.com/KyleGortych][My github account]]
 Linkedin:   [[https://www.linkedin.com/in/kyle-gortych-163449240][My Linkedin account]]

 DESC:               config for vim via homebrew via iTerm2.
 WARNING:            Run this script at your own risk.
 License:            Declared in repo
 DEPENDENCIES:       emacs-mac ±, Doom ±
 Date last modified: 07-25-2022
#+end_comment

* Dotfiles
Note: I moved most of my config files to .config directory. Insted of a bare git repo and updating the index, I just symbolically linked this one file to the git working directory. Make sure code snippets don’t write to symbolic links but, the config files actual location. Also, all file paths should be absolute not relative to the org doc. All code blocks can be evaluated as txt. If you need to test a subsection use :! rather than a shell code snippet.

Commands
  - insert snippet: <s tab
  - Export to files: C-c C-v t
  - For fast pasting: :.!cat /path/file_name
  -

* Shell Alias Support

#+begin_src txt :tangle ~/.config/CLI\ Support/aliase\ \&\ script\ support/fish_aliases.txt
fish aliases
-------------
ls-env|brew-pkgs-nodepens|brew-active-pkgs-nodepens|open-exit
filemgr|doom|tips|git-ls
*
Language package managers
--------------------------
pip3-ls-pkgs|apl-run-script|yarn-nodepens|verilog-compile
verilog-run
*
Curl aliases
-------------
check-curl|weather|check-news|check-stockmarket
#+end_src

#+begin_src txt :tangle ~/.config/CLI\ Support/aliase\ \&\ script\ support/brew-pkgs.txt
Packages no Depens
-------------------
arduino-cli|geoip|luajit-openresty|sd
avrdude|ghq|markdown|shellcheck
bash|git|meson|sphinx-doc
bat|gnu-apl|mono|starship
bfg|gnu-cobol|mujs|tidy-html5
btop|gnu-sed|neofetch|tmux
cabal-install|go|neovim|uchardet
calcurse|httpstat|nghttp2|uncrustify
checkbashisms|icarus-verilog|node|universal-ctags
cmake|intltool|openjdk@11|vapoursynth
cmake-docs|kotlin|openjdk@8|w3m
cmus|kubernetes-cli|osx-cpu-temp|wasm3
coq|libelf|parallel|watchman
desktop-file-utils|libftdi0|perl|watson
entr|libhid|qt@5|xdg-ninja
espeak|libmagic|emacs-mac|xplr
evince|libnotify|ripgrep|yarn
exa|libspiro|ruby|youtube-dl
fd|libssh2|rust-analyzer
figlet|libuninameslist|rustup-init
fish|lolcat|sc-im
*
Casks
------
adoptopenjdk8|fontforge|kitty|obs
android-sdk|freecad|libreoffice|openshot-video-editor
balenaetcher|keycastr|mactex-no-gui|timemachineeditor
cool-retro-term|kicad|mpv|vieb
#+end_src

copy past from brew leaves

regex such that delete empty spaces and replace with one delimeter
:n1,n2 s/\s\+/|/g

#+begin_src txt :tangle ~/.config/CLI\ Support/aliase\ \&\ script\ support/tips.txt
Main concepts for most programming languages

Importing modules
from module import fn1, fn2, fn3, \
fn4, fn5

Comments
-	Header
/*
 * title:
 * <insert>
 *
 * Description:
 * <insert>
 *
 * Maintainer: Name
 * Date:
 */

Temporary list

/*
 * temporary list | remove when done
 *     1.
 *     2.
 */

Doc str contracts
  -	Can be referenced for assertion errors
    mesgs from help() in CLI
  -	Designates who is responsible for errors
    when multiple people work on the same
    file but each person is given multiple
    functions. At end add Maintainer: & Date
    Last Modified:.

class name();             fn name();
   /*                         /*
    * Description:             * Description:
    *     <insert>             *     <insert>
    *                          *
    * Attributes:              * Ex. Test Cases: // semi optional
    *     name: str            *     <insert>
    *     age:  int            *
    *                          * param, var, invariant, ect.: // invariants |
    * Methods:                 *     <insert>                 // constants &
    *     <insert>             *                              // non mutable
    */                         * Precondition:
                               *     <insert>
                               *
                            -> * Postcondition: // only for debugging
                            -> *     <insert>
                            -> *
                               * Return:
                               *     <insert>
                               */ 
Testing
For large test cases, use unit test that
contains all possible conditions. If correct
return correct if not return each test case
line with error.

Asserting pre and post conditions
assert <args>, ‘description’ // assertion error mesg

precondition assertion errors are end-user fault
postcondition assertion errors is the specified programmer or programmer‘s fault

Question: how to determine between pre and post condition assertion errors

Modules vs Scripts

Module uses prompt env
$ python#       // python --version
>>> import file

Script runs interpreter or compiler
$ python# file.py

Branchless programming convention

First use if and else for the compiler to
optimize then look at compiled file in asm to
change to branchless when needed. Use vim
macros to search for occurrences were manual
branchless programming wasn’t minimized for
faster implementation. Branchless could cause
slower performance there for only use when
compiler added unassay branches.

If(a>b) {     int fast_max(int a, int b) {
return a;          int diff = a-b;
}else{             int dsgn = giff>>31;
return b;          return a-(diff & dsgn);
}             }

Compiling

To view compiled code in asm
  note each compiler has different arguments

make file parallel compile
see if go build ./ parallel compiles files in current dir

Rust ex.
rustc file name –emit asm

C ex.
gcc name.c -S

Script Languages

Right click on webpage and select view source to see src
Right click inspect to edit in the browser 
Microsoft Office

Print on one or both sides click print then last dropdown bar layout options
Command control spacebar opens symbols | no need for inserting equation.
Replace all occurecnes of a word hold crt shift h | H  
Minimalist Framework and Config Dot Files for Terminal

Remove redundancies and debloat workflow

Main terminal emulator mac
-	Created rosette duplicate

CLI
-	Fish tab completion for flag args list
-	open opens an application
 - open path/path name
 - open -a name
 - open -a “sublime text” // for spaces in app name
-	osascript -e 'quit app "freecad"' // saves and quits app?
-	cd brings you to default home
-	cd directory path
-	type cd drag folder from file manager for path
-	ls to list directory contents
-	ls -l list directory contents in rwx/octal
-	time command | lists length of time for the execution of proceeding command
-	open -e .bash_profile or .bashrc or etc. files
-	View binary files exception for proprietary flies
-	Parallel downloading for package managers
-	Gnu parallel vs &
-	last | see recent activity
- neovide -- -p file-name | like vim -p
- cat /etc/shells


python prompt
-	ctrl l | clears

Network security
-	ping
-	nslookup
-	networksetup -listallhardwareports

Questions
-	How to organize programming languages lsp clients, frameworks, and compilers | one build system?
-	Should homebrew path be /opt/homebrew or in /usr/local?
-	Change non interactive shell sh to dash by resymlink?
  -	readlink /var/select/sh , outputs /bin/dash
-	Check if any scripts including homebrew aren’t POSIX compliant ex. #!/bin/sh shebang
-	Bench test fish running as a command in dashrc dash shell vs making fish default shell?
 
Migration to Linux
1.)	 Automate process of transferring
homebrew package-manager | all configs and
tools are installed with distro’s
package-manager also create aliases for the
distros package-manager to reduce command
complexity similar to the commands of
homebrew.
2.)

Vim work flow

1.) nnn command n | file manager | q quit | changes path to current directory
2.) Vim Tabs | current dir | vim -p file.extention file.extention ./dirname/file.extention ../dirname/file.extention | tabnew & tabfind
3.) Vim templates plugin
4.) Movements jklh and w b and dw | delet word
5.) Fold by shift v then zf highlighted text | za toggles a fold under cursor and zR opens all while zM closes all
6.) /word enter | n to toggle between words | :number,number/search/replace
7.) / also can move between tags ex. <> {} | /> or /} or /< for <htm>_</htm>
8.) :set spell and : set nospell | n to toggle between misspelled words
9.) Visual block | ctrl v | to comment | ctrl v move cursor then shift i esc

for files with long lines -- Command --
:NoMatchParen | set nocul | set lz | set smc=80

zt at current cursor row moves view to top

Command :2000 jumps cursor to line 2000
faster than {} jumping paragraphs and dosnt
over shoot like shift g or gg

Blank buffer to enter multiple blank lines
fast enter insert mode enter once then in
normal mode hit number of lines needed
excluding present two then dot command | i
enter esc 15.

Past horizontally
Copy with v and past | to past 10 use 9 shift p

Past vertically
Copy line with shift v and past on same line | to past 10 use 9p

Pasting outside vim | (:ALEToggle | set nonumber) then highlight with mouse

df char then dot | delete line segments that aren't aligned

Visual mode shift v and shift j | highlighted horizontal moved to vertical

Add shift a & shift i, (f char | , and ;), and . aka “dot” commands.

~ to toggle casing char under cursor then w.
For all upper case…

Describe Wildmenue as auto suggest/complete command mode
Wildmenue search and replace for quick function expressions copy past
:8,10 s/search/replace/g out line example also, :%s/search/replace/g entire file.

vim version 8 Visual block increment | vertical
ctrl v select second index to end & g ctrl a for num increment
Also letter and hex and more
Increment under cursor | ctrl a also decrement ctrl x

Vim ale:
ALEToggle

Bash scripting

CLI: touch filename.sh
Shebang

Chmod +x ./filename.sh

To run type ./filename.sh

Doom Emacs

Leader key: SPC

org mode
  export:
  blank
  tangle:

Magit
  unstaged files

build sys
----------
env:           .profile vs /etc/profile and shell path fragmentation
$PATH:
.env files:    omit sensitive info through gitignore, application dependent
*
       == editors ==
doom-emacs         vim
-----------        ----
via lsp          ? via ALE
fixer: lsp or pkg? fixer: via vimrc via ALE sec via either lan pkg mgr or sys pkg mgr
linter: company  ? linter: via vimrc via ALE sec via either lan pkg mgr or sys pkg mgr
*
lang pkg mgr
-------------
Check if tools via sys level pkg mgr or lang pkg mgr?
Then resolve fragmentation.
note: some fixers need config
*
apl            interp: gnu-apl via homebrew
verilog        compiler: iverilog via homebrew
bash           linter: shellcheck via homebrew
c              ?
fish           linter: shellcheck? via homebrew
f#             ?
haskell        ?
java           ?
html           linter: tidy-html5 via homebrew
css            linter: csslint via npm make prjk or global?
javascript     bun via curl and homebrew yarn eslint and csslint
kotlin         ?
python current anaconda in home? pip3 via pip? linter: pylint via pip and pip3 lists same packages
python note:   add to brew python, pip, pip3 and anaconda
rust           via cargo compiler rustc linter aysnc ? fixer ?
cargo          add new prjc name cargo build?
go             via homebrew also a dependency
#+end_src

* Fish Shell

#+begin_src txt :tangle ~/.config/fish/config.fish
# Put system-wide fish configuration entries here
# or in .fish files in conf.d/
# Files in conf.d can be overridden by the user
# by files with the same name in $XDG_CONFIG_HOME/fish/conf.d

# This file is run by all fish instances.
# To include configuration only for login shells, use
# if status is-login
#    ...
# end
# To include configuration only for interactive shells, use
# if status is-interactive
#   ...
# end

# Paths
# fish_add_path /usr/local/sbin

# $PATH added to /.config/fish and .profile?
# resolve fragmented paths

# nvim to neovide.app ?
# fish_add_path /usr/local/bin/brew shellenv

# disable fish greeting
set fish_greeting

# starship prompt
starship init fish | source

# negate fish vi cursor
function fish_vi_cursor
  ;
end

# neofetch
if status is-interactive
  # move script to bin | ps outputs interpreter running?
  # ~/.config/CLI\ Support/sh\ scripts/./info.sh

  neofetch --colors --colors 9 2 3 39 15 15 --backend iterm2 --source ~/Downloads/vim2.png --size 20%
  date +"-- %a %m-%d-%Y %I:%M%p --"
  printf '\n'
  ps
end

# aliases

function aliases
  column -t -s '|' ~/.config/CLI\ Support/aliase\ \&\ script\ support/fish_aliases.txt | tr '*' ' '
end

# pkill verify pid match
# function terminate
#   ps | rg $argv && pkill $argv
# end

# concat commands with mktemp auto rm after termination?
# function network-info
#   ((ifconfig | rg "inet" | rg -v 127.0.0.1) && networksetup -listallhardwareports) | less
# end

function check-curl
  curl $argv | less
end

function ls-env
  env | column -t -s '='
end

function brew-pkgs-nodepens
  column -t -s '|' ~/.config/CLI\ Support/aliase\ \&\ script\ support/brew-pkgs.txt | tr '*' ' '
end

function brew-active-pkgs-nodepens
  echo -e '\e[4mPackages no Depens\e[0m' ; brew leaves | column ; echo '' ; echo -e '\e[4mCasks\e[0m' ; brew list --cask
end

function tips
  less ~/.config/CLI\ Support/aliase\ \&\ script\ support/tips.txt
end

function pip3-ls-pkgs
  pip3 list --not-required
end

# add input?
# yarn list --pattern "$argv" --depth=1
function yarn-nodepens
  yarn list --depth=0
end

function weather
  curl wttr.in/$argv
end

function check-stockmarket
  curl terminal-stocks.shashi.dev/$argv
end

function check-news
  curl getnews.tech/$argv || curl getnews.tech
end

function open-exit
  open -a "$argv" && exit
end

function filemgr
  cd $(xplr --print-pwd-as-result)
end

function apl-run-script
  apl --noSV --noColor --noCIN -q -f $argv
end

function verilog-compile
  iverilog -o $argv
end

function verilog-run
  vvp $argv
end

function doom
  ~/.emacs.d/bin/doom $argv
end

# function kotlin-run-script
#   kotlinc $argv -include-runtime -d $argv && java -jar $argv
# end

# git aliases
function git-ls
  git diff --staged --name-only
end

# Bun
set -Ux BUN_INSTALL "/Users/kylegortych/.bun"
set -px --path PATH "/Users/kylegortych/.bun/bin"
#+end_src

* starship prompt

#+begin_src txt :tangle ~/.config/starship.toml
# note: colores can be diffrent for your shell color scheme
# use of true colors is not discused for starship prompt documentation
# as best practice terminal emulator should have all colors the same
# each config file has color settings to avoid conflics

# needed for nnn cd in current dir on quit
command_timeout = 1000

[character]
success_symbol = "[❯❯](bold #ff8700)"
error_symbol   = "[✘](red)"
vicmd_symbol   = "[❮❮](bold #ff8700)"

[directory]
style = "#00afff"

[cmd_duration]
style = "#ff8700"

[jobs]
symbol = "✨"

# Languages

[rust]
symbol = "☣️  "
#+end_src

